comparison/results_reprod/dsb_other/bench100/compose_2c/out_1_181.log
Running 30s test @ http://192.168.1.74:8080/wrk2-api/post/compose
  1 threads and 1 connections
  Thread calibration: mean lat.: 12.017ms, rate sampling interval: 54ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    11.94ms    9.48ms  43.65ms   84.81%
    Req/Sec   180.73     54.06   277.00     65.31%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.53ms
 75.000%   14.98ms
 90.000%   26.70ms
 99.000%   43.65ms
 99.900%   50.56ms
 99.990%   54.33ms
 99.999%   54.33ms
100.000%   54.33ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.371     0.000000            1         1.00
       4.003     0.100000          361         1.11
       4.343     0.200000          719         1.25
       5.527     0.300000         1078         1.43
       7.183     0.400000         1437         1.67
       8.527     0.500000         1795         2.00
       9.375     0.550000         1974         2.22
      10.487     0.600000         2154         2.50
      11.695     0.650000         2332         2.86
      13.047     0.700000         2511         3.33
      14.983     0.750000         2692         4.00
      16.007     0.775000         2780         4.44
      17.391     0.800000         2870         5.00
      19.375     0.825000         2960         5.71
      21.503     0.850000         3049         6.67
      24.015     0.875000         3139         8.00
      25.359     0.887500         3184         8.89
      26.735     0.900000         3229        10.00
      27.599     0.912500         3275        11.43
      29.199     0.925000         3318        13.33
      31.055     0.937500         3363        16.00
      31.951     0.943750         3386        17.78
      33.055     0.950000         3408        20.00
      34.335     0.956250         3431        22.86
      36.127     0.962500         3453        26.67
      37.279     0.968750         3475        32.00
      38.271     0.971875         3488        35.56
      39.007     0.975000         3498        40.00
      40.063     0.978125         3510        45.71
      40.703     0.981250         3521        53.33
      41.887     0.984375         3531        64.00
      42.367     0.985938         3537        71.11
      43.039     0.987500         3543        80.00
      43.455     0.989062         3549        91.43
      43.935     0.990625         3554       106.67
      44.415     0.992188         3559       128.00
      45.279     0.992969         3562       142.22
      45.471     0.993750         3565       160.00
      46.143     0.994531         3568       182.86
      46.495     0.995313         3571       213.33
      46.783     0.996094         3573       256.00
      47.487     0.996484         3575       284.44
      47.999     0.996875         3576       320.00
      48.479     0.997266         3578       365.71
      48.639     0.997656         3579       426.67
      49.727     0.998047         3580       512.00
      49.791     0.998242         3581       568.89
      50.303     0.998437         3582       640.00
      50.559     0.998633         3583       731.43
      50.559     0.998828         3583       853.33
      50.783     0.999023         3584      1024.00
      50.783     0.999121         3584      1137.78
      50.879     0.999219         3585      1280.00
      50.879     0.999316         3585      1462.86
      50.879     0.999414         3585      1706.67
      51.583     0.999512         3586      2048.00
      51.583     0.999561         3586      2275.56
      51.583     0.999609         3586      2560.00
      51.583     0.999658         3586      2925.71
      51.583     0.999707         3586      3413.33
      54.335     0.999756         3587      4096.00
      54.335     1.000000         3587          inf
#[Mean    =       11.940, StdDeviation   =        9.476]
#[Max     =       54.304, Total count    =         3587]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5417 requests in 30.00s, 1.11MB read
Requests/sec:    180.56
Transfer/sec:     37.91KB