comparison/results_reprod/dsb_other/bench100/compose_2c/out_1_201.log
Running 30s test @ http://192.168.1.74:8080/wrk2-api/post/compose
  1 threads and 1 connections
  Thread calibration: mean lat.: 14.755ms, rate sampling interval: 64ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    13.65ms   11.15ms  53.38ms   85.72%
    Req/Sec   201.86     51.83   285.00     65.38%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    9.86ms
 75.000%   17.47ms
 90.000%   29.33ms
 99.000%   53.38ms
 99.900%   68.74ms
 99.990%   72.38ms
 99.999%   72.38ms
100.000%   72.38ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.401     0.000000            1         1.00
       4.047     0.100000          402         1.11
       4.679     0.200000          803         1.25
       6.383     0.300000         1204         1.43
       8.019     0.400000         1607         1.67
       9.863     0.500000         2007         2.00
      11.087     0.550000         2209         2.22
      12.199     0.600000         2410         2.50
      13.439     0.650000         2609         2.86
      15.247     0.700000         2810         3.33
      17.471     0.750000         3012         4.00
      19.231     0.775000         3111         4.44
      20.703     0.800000         3211         5.00
      22.239     0.825000         3311         5.71
      24.143     0.850000         3412         6.67
      26.543     0.875000         3512         8.00
      27.743     0.887500         3563         8.89
      29.327     0.900000         3612        10.00
      30.879     0.912500         3662        11.43
      32.959     0.925000         3714        13.33
      34.687     0.937500         3765        16.00
      35.711     0.943750         3789        17.78
      37.023     0.950000         3814        20.00
      38.591     0.956250         3838        22.86
      40.095     0.962500         3863        26.67
      41.727     0.968750         3890        32.00
      42.527     0.971875         3901        35.56
      43.327     0.975000         3913        40.00
      44.511     0.978125         3926        45.71
      46.271     0.981250         3938        53.33
      48.799     0.984375         3951        64.00
      49.535     0.985938         3957        71.11
      50.591     0.987500         3963        80.00
      52.063     0.989062         3970        91.43
      53.727     0.990625         3976       106.67
      58.175     0.992188         3982       128.00
      58.655     0.992969         3985       142.22
      60.191     0.993750         3988       160.00
      62.847     0.994531         3992       182.86
      63.647     0.995313         3995       213.33
      64.671     0.996094         3998       256.00
      64.991     0.996484         3999       284.44
      66.303     0.996875         4001       320.00
      66.559     0.997266         4003       365.71
      67.007     0.997656         4004       426.67
      67.263     0.998047         4006       512.00
      67.263     0.998242         4006       568.89
      67.519     0.998437         4007       640.00
      68.607     0.998633         4008       731.43
      68.735     0.998828         4009       853.33
      69.631     0.999023         4010      1024.00
      69.631     0.999121         4010      1137.78
      69.631     0.999219         4010      1280.00
      69.695     0.999316         4011      1462.86
      69.695     0.999414         4011      1706.67
      71.231     0.999512         4012      2048.00
      71.231     0.999561         4012      2275.56
      71.231     0.999609         4012      2560.00
      71.231     0.999658         4012      2925.71
      71.231     0.999707         4012      3413.33
      72.383     0.999756         4013      4096.00
      72.383     1.000000         4013          inf
#[Mean    =       13.652, StdDeviation   =       11.151]
#[Max     =       72.320, Total count    =         4013]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6022 requests in 30.00s, 1.23MB read
Requests/sec:    200.73
Transfer/sec:     42.15KB