comparison/results_reprod/dsb_other/bench100/compose_2c/out_1_241.log
Running 30s test @ http://192.168.1.74:8080/wrk2-api/post/compose
  1 threads and 1 connections
  Thread calibration: mean lat.: 22.336ms, rate sampling interval: 88ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    30.59ms   36.29ms 175.62ms   89.86%
    Req/Sec   239.48     37.54   284.00     81.94%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   18.30ms
 75.000%   34.78ms
 90.000%   67.71ms
 99.000%  175.62ms
 99.900%  189.57ms
 99.990%  193.54ms
 99.999%  193.54ms
100.000%  193.54ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.479     0.000000            1         1.00
       4.891     0.100000          479         1.11
       7.855     0.200000          955         1.25
      10.807     0.300000         1433         1.43
      14.247     0.400000         1911         1.67
      18.303     0.500000         2387         2.00
      20.767     0.550000         2627         2.22
      23.599     0.600000         2866         2.50
      26.879     0.650000         3107         2.86
      30.255     0.700000         3342         3.33
      34.783     0.750000         3581         4.00
      36.927     0.775000         3700         4.44
      39.519     0.800000         3820         5.00
      42.751     0.825000         3939         5.71
      47.935     0.850000         4058         6.67
      58.079     0.875000         4178         8.00
      63.231     0.887500         4238         8.89
      67.711     0.900000         4297        10.00
      78.783     0.912500         4357        11.43
      87.679     0.925000         4416        13.33
     100.479     0.937500         4476        16.00
     111.807     0.943750         4506        17.78
     118.015     0.950000         4536        20.00
     133.247     0.956250         4566        22.86
     148.991     0.962500         4595        26.67
     156.287     0.968750         4625        32.00
     158.335     0.971875         4640        35.56
     159.743     0.975000         4655        40.00
     162.559     0.978125         4671        45.71
     165.503     0.981250         4685        53.33
     169.727     0.984375         4700        64.00
     171.263     0.985938         4707        71.11
     173.055     0.987500         4715        80.00
     175.103     0.989062         4722        91.43
     176.383     0.990625         4730       106.67
     178.559     0.992188         4737       128.00
     179.327     0.992969         4741       142.22
     180.351     0.993750         4746       160.00
     180.991     0.994531         4748       182.86
     182.783     0.995313         4753       213.33
     183.807     0.996094         4756       256.00
     184.319     0.996484         4758       284.44
     184.959     0.996875         4760       320.00
     185.599     0.997266         4761       365.71
     186.751     0.997656         4763       426.67
     188.415     0.998047         4765       512.00
     188.671     0.998242         4766       568.89
     188.927     0.998437         4767       640.00
     189.055     0.998633         4768       731.43
     189.567     0.998828         4769       853.33
     189.695     0.999023         4770      1024.00
     189.695     0.999121         4770      1137.78
     189.823     0.999219         4771      1280.00
     189.823     0.999316         4771      1462.86
     191.487     0.999414         4772      1706.67
     191.487     0.999512         4772      2048.00
     191.487     0.999561         4772      2275.56
     192.511     0.999609         4773      2560.00
     192.511     0.999658         4773      2925.71
     192.511     0.999707         4773      3413.33
     192.511     0.999756         4773      4096.00
     192.511     0.999780         4773      4551.11
     193.535     0.999805         4774      5120.00
     193.535     1.000000         4774          inf
#[Mean    =       30.588, StdDeviation   =       36.289]
#[Max     =      193.408, Total count    =         4774]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7192 requests in 30.00s, 1.47MB read
Requests/sec:    239.71
Transfer/sec:     50.33KB